#!/bin/bash

#definição de cores para o letreiro do pipeline no terminal
CYAN='\033[1;36m'
NC='\033[0m' #serve para voltar o terminal para a cor normal

echo -e "${CYAN}"
cat << "EOF"
█████████                    █████      █████                ██████       █████     ███
 ███░░░░░███                 ░░███     ░░███                 ███░░███    ░░███     ░░░
░███    ░███    ██████        ░██████   ░███████    ██████  ░███ ░░░      ░███     █████   ████████
░██████████    ░░░░░███       ░███░░    ░███░░███  ███░░███ ░███          ░███    ░░███   ░░███░░███
░███░░░░░░       ███████      ░███      ░███ ░███ ░███ ░███ ░███          ░███     ░███    ░███ ░███
░███            ███░░███      ░███  █   ░███ ░███ ░███ ░███ ░███  ███     ░███     ░███    ░███ ░███
█████          ░░████████     ░░█████   █████ █████░░██████ ░░██████      █████    █████   █████ █████
░░░░░           ░░░░░░░░       ░░░░░   ░░░░░ ░░░░░  ░░░░░░   ░░░░░░      ░░░░░    ░░░░░   ░░░░░ ░░░░░
EOF
echo "Bem vindo ao PathoClin!"
echo "Versão: 0.1.0"
echo "Criado por: João Gabriel Barbosa de Luna"
echo "Referências bibliográficas em REFERENCES.md"
echo -e "${NC}"

#execução do snakemake para processar as variantes
echo -e "${CYAN}"
echo "Executando pipeline snakemake..."
echo -e "${NC}"
snakemake --cores all




